from bot import bot
from ml_dict import ml


def text(message):
    if message.chat.type == 'private':
        if message.text == '1.Архитектура и основные составные части систем ИИ':
            bot.send_message(message.chat.id, str(ml['1.Архитектура и основные составные части систем ИИ']))
        elif message.text == '2.Системы распознавания образов (идентификации)':
            bot.send_message(message.chat.id, str(ml['2.Системы распознавания образов (идентификации)']))
        elif message.text == '3.Адаптация и обучение':
            bot.send_message(message.chat.id, str(ml['3.Адаптация и обучение']))
        elif message.text == '4.Автоматизированный синтез физических принципов действия. Синтез речи.':
            bot.send_message(message.chat.id, str(ml["4.Автоматизированный синтез физических принципов действия. Синтез речи."]))
        elif message.text == '5.Методы и алгоритмы анализа структуры многомерных данных.':
            bot.send_message(message.chat.id, str(ml["5.Методы и алгоритмы анализа структуры многомерных данных."]))
        elif message.text == "6.Языки программирования для решения задач ИИ":
            bot.send_message(message.chat.id, str(ml["6.Языки программирования для решения задач ИИ"]))
        elif message.text == "7.Сферы использования языка Python":
            bot.send_message(message.chat.id, str(ml["7.Сферы использования языка Python"]))
        elif message.text == "8.Методы машинного обучения":
            bot.send_message(message.chat.id, str(ml["8.Методы машинного обучения"]))
        elif message.text == "9.Сист подход при разработке КИС":
            bot.send_message(message.chat.id, str(ml["9.Сист подход при разработке КИС"]))
        elif message.text == "10.Инф, прогр, технич, матем и др. обеспеч КИС.":
            bot.send_message(message.chat.id, str(ml["10.Инф, прогр, технич, матем и др. обеспеч КИС."]))
        elif message.text == "11.Критерии качества и экономической эффективности внедрения и эксплуатации КИС.":
            bot.send_message(message.chat.id, str(ml["11.Критерии качества и экономической эффективности внедрения и эксплуатации КИС."]))
        elif message.text == "12.Унифицированные способы представления базовых концепций бизнес-процессов. Диаграммы BPMN.":
            bot.send_message(message.chat.id, str(ml["12.Унифицированные способы представления базовых концепций бизнес-процессов. Диаграммы BPMN."]))

        elif message.text == "13.Интеллектуальные системы. Виды, состав, области применения инт.систем.":
            bot.send_message(message.chat.id, str(ml["13.Интеллектуальные системы. Виды, состав, области применения инт.систем."]))
        elif message.text == "14.Экспертные системы. Применение систем поддержки принятия решений.":
            bot.send_message(message.chat.id, str(ml["14.Экспертные системы. Применение систем поддержки принятия решений."]))
        elif message.text == "15.Сети передачи данных. Локальные и глобальные вычислительные сети.":
            bot.send_message(message.chat.id, str(ml["15.Сети передачи данных. Локальные и глобальные вычислительные сети."]))
        elif message.text == "16.Принципы организации сети Интернет.":
            bot.send_message(message.chat.id, str(ml["16.Принципы организации сети Интернет."]))
        elif message.text == "17.Основные понятия теории сложных систем. Основные принципы системного подхода. Понятие декомпозиции и координации.":
            bot.send_message(message.chat.id, str(ml["17.Основные понятия теории сложных систем. Основные принципы системного подхода. Понятие декомпозиции и координации."]))
        elif message.text == "18.Оптимизация сложных систем. Методы оптимизации.":
            bot.send_message(message.chat.id, str(ml["18.Оптимизация сложных систем. Методы оптимизации."]))
        elif message.text == "19":
            bot.send_message(message.chat.id, str(ml["19"]))
        elif message.text == "20.Основные опр-ия и теоремы теории игр. Методы решения задач.":
            bot.send_message(message.chat.id, str(ml["20.Основные опр-ия и теоремы теории игр. Методы решения задач."]))
        elif message.text == "21.Теория массового обслуживания. Определение характеристик типовых систем массового обслуживания (СМО). Приоритетные СМО.":
            bot.send_message(message.chat.id, str(ml["21.Теория массового обслуживания. Определение характеристик типовых систем массового обслуживания (СМО). Приоритетные СМО."]))
        elif message.text == "22.Методы статистического моделирования СМО.":
            bot.send_message(message.chat.id, str(ml["22.Методы статистического моделирования СМО."]))
        elif message.text == "23.Имитационное моделирование":
            bot.send_message(message.chat.id, str(ml["23.Имитационное моделирование"]))
        elif message.text == "24.Теория расписаний. Задача упорядочения. Функции штрафа. Типовые задачи.":
            bot.send_message(message.chat.id, str(ml["24.Теория расписаний. Задача упорядочения. Функции штрафа. Типовые задачи."]))
        elif message.text == "25.Энтропия дискретных источников сообщений и сложных систем":
            bot.send_message(message.chat.id, str(ml["25.Энтропия дискретных источников сообщений и сложных систем"]))
        elif message.text == "26.Идентификация объектов. Метод регрессивного анализа.":
            bot.send_message(message.chat.id, str(ml["26.Идентификация объектов. Метод регрессивного анализа."]))
        elif message.text == "27.Задачи идентификации и классификации. Метод экспертных оценок.":
            bot.send_message(message.chat.id, str(ml["27.Задачи идентификации и классификации. Метод экспертных оценок."]))
        elif message.text == "28.Функциональные характеристики системы. Пространство траекторий функционирования. Функционалы.":
            bot.send_message(message.chat.id, str(ml["28.Функциональные характеристики системы. Пространство траекторий функционирования. Функционалы."]))
        elif message.text == "29.Объектно-ориентированный анализ и проектирование.":
            bot.send_message(message.chat.id, str(ml["29.Объектно-ориентированный анализ и проектирование."]))
        elif message.text == "30.Понятие жизненного цикла информационной системы. Модели и основные этапы жизненного цикла.":
            bot.send_message(message.chat.id, str(ml["30.Понятие жизненного цикла информационной системы. Модели и основные этапы жизненного цикла."]))
        elif message.text == "31.Вычислительные системы. Состав и структура вычислительных систем.":
            bot.send_message(message.chat.id, str(ml["31.Вычислительные системы. Состав и структура вычислительных систем."]))
        elif message.text == "32":
            bot.send_message(message.chat.id, str(ml["32"]))
        elif message.text == "33.Оптимизация сложный систем. Многокритериальная оптимизация.":
            bot.send_message(message.chat.id, str(ml["33.Оптимизация сложный систем. Многокритериальная оптимизация."]))
        elif message.text == "34.Выбор стратегии информационного поиска. Выбор методов адресации данных. Доступ к данным.":
            bot.send_message(message.chat.id, str(ml["34.Выбор стратегии информационного поиска. Выбор методов адресации данных. Доступ к данным."]))
        elif message.text == "35":
            bot.send_message(message.chat.id, str(ml["35"]))
        elif message.text == "36.Системы отображения информации. Виртуальная реальность.":
            bot.send_message(message.chat.id, str(ml["36.Системы отображения информации. Виртуальная реальность."]))
        elif message.text == "37.Динамические системы. Движение системы. Траектории функционирования системы.":
            bot.send_message(message.chat.id, str(ml["37.Динамические системы. Движение системы. Траектории функционирования системы."]))
        elif message.text == "38.Логико-динамическая модель системы.":
            bot.send_message(message.chat.id, str(ml["38.Логико-динамическая модель системы."]))
        elif message.text == "39.Системы управления качеством программного обеспечения":
            bot.send_message(message.chat.id, str(ml["39.Системы управления качеством программного обеспечения"]))
        elif message.text == "40.Формализованное описание элементов системы и взаимодействия между ними.":
            bot.send_message(message.chat.id, str(ml["40.Формализованное описание элементов системы и взаимодействия между ними."]))






        else:
            bot.send_message(message.chat.id, 'Ты сказал "' + message.text + '" А я не знаю, что сказть 😿. Чтобы узнать новый факт про кота напиши /start')
